       IDENTIFICATION DIVISION.
       PROGRAM-ID. WAREBALL-FILE-TEST.
       AUTHOR. theluqmn.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT-SECTION.
       FILE-CONTROL.
           SELECT INVENTORY-DATA