       IDENTIFICATION DIVISION.
       PROGRAM-ID. WAREBALL-FILE-TEST.
       AUTHOR. theluqmn.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENTORY-FILE ASSIGN TO "inventory"
               ORGANIZATION IS INDEXED
               ACCESS IS RANDOM
               RECORD KEY IS ITEM-ID
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD INVENTORY-FILE.
       01 INVENTORY-RECORD.
           05 ITEM-ID          PIC X(10).
           05 ITEM-DESCRIPTION PIC X(50).
           05 ITEM-QUANTITY    PIC 9(5).
           05 ITEM-PRICE       PIC 9(7)V99.
       
       WORKING-STORAGE SECTION.
       01 FILE-STATUS          PIC XX.
       01 WS-ITEM-ID           PIC X(10).
       01 WS-ITEM-QUANTITY     PIC 9(5).
       01 WS-ITEM-PRICE        PIC 9(7)V99.

       PROCEDURE DIVISION.
       OPEN OUTPUT INVENTORY-FILE.

       MOVE "ITEM000001" TO ITEM-ID.
       MOVE "TESTING ITEM" TO ITEM-DESCRIPTION.
       MOVE 100 TO ITEM-QUANTITY.
       MOVE 15.60 TO ITEM-PRICE.
       WRITE INVENTORY-RECORD.

       CLOSE INVENTORY-FILE.
       END PROGRAM WAREBALL-FILE-TEST.
