      *this is a COBOL program to handle inventory management
       IDENTIFICATION DIVISION.
       PROGRAM-ID. "WAREBALL".
       AUTHOR. "theluqmn".
       ENVIRONMENT DIVISION.
       PROCEDURE DIVISION.

      *displaying hello world
       DISPLAY "Hello, World!".

       STOP RUN.
       END PROGRAM WAREBALL.